{"config": [{"config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u009f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "trainable": true, "name": "lambda_1", "dtype": "float32", "output_shape": null, "batch_input_shape": [null, 80, 320, 3], "arguments": {}}, "class_name": "Lambda"}, {"config": {"kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "filters": 16, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [8, 8], "name": "conv2d_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "filters": 32, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [5, 5], "name": "conv2d_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "padding": "valid", "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [5, 5], "name": "conv2d_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 127, "activation": "linear", "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 84, "activation": "linear", "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_regularizer": null, "units": 1, "activation": "linear", "name": "dense_3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.6"}