{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>S\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 64, 64, 3], "output_shape_type": "raw", "trainable": true, "name": "lambda_1", "arguments": {}, "function_type": "lambda", "dtype": "float32", "output_shape": [64, 64, 3]}, "class_name": "Lambda"}, {"config": {"activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_1", "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 3, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_2", "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 3, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_3", "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "filters": 3, "trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [3, 3], "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "units": 127, "name": "dense_1", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "units": 84, "name": "dense_2", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "units": 1, "name": "dense_3", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "bias_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.3"}